src/Catalogs/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.ГруппыПользователей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПриЗапуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбновлениеИнформационнойБазы/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБНОВЛЕНИЯ ИБ 

//// Процедура проверяет, есть ли необходимость выполнять обновление информационной базы.
//// Если необходимо - выполняется обновление.
//// Если обновление не удалось выполнить, то
//// - предлагает завершить работу системы (в режиме клиента);
//// - выбрасывает исключение с описанием ошибки (в режиме внешнего соединения).
////
//// Вызывается в режиме клиента или внешнего соединения.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт
//	
//	// Проверка необходимости обновления информационной базы.
//	Если НЕ ПустаяСтрока(Метаданные.Версия)
//	   И Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда
//		#Если Клиент Тогда
//		Предупреждение("Изменился номер версии конфигурации. Будет выполнено обновление информационной базы.");
//		#КонецЕсли
//	Иначе
//		Возврат;
//	КонецЕсли;

//	// Проверка наличия прав для обновления информационной базы.
//	Если НЕ ПравоДоступа("МонопольныйРежим", Метаданные) 
//	 ИЛИ НЕ ПравоДоступа("Использование",    Метаданные.Обработки.ОбновлениеИнформационнойБазы) 
//	 ИЛИ НЕ ПравоДоступа("Просмотр",         Метаданные.Обработки.ОбновлениеИнформационнойБазы) Тогда

//		#Если Клиент Тогда
//		Предупреждение("Недостаточно прав для выполнения обновления. Работа системы будет завершена.");

//		ЗавершитьРаботуСистемы();
//		#КонецЕсли
//		Возврат;
//	КонецЕсли;

//	БазоваяПоставка = (Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0);
//	
//	// Установка монопольного режима для обновления информационной базы.
//	Если НЕ БазоваяПоставка Тогда
//		
//		// Установка монопольного режима для обновления информационной базы.
//		Попытка
//			УстановитьМонопольныйРежим(Истина);
//		Исключение
//			Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
//			#Если Клиент Тогда
//			Предупреждение("Не удалось установить монопольный режим. Работа системы будет завершена.");
//			
//			ЗавершитьРаботуСистемы();
//			#КонецЕсли
//			Возврат;
//		КонецПопытки;
//		
//	КонецЕсли; 

//	// Обновление информационной базы.
//	Обработки.ОбновлениеИнформационнойБазы.Создать().ВыполнитьОбновление();

//	// Откючение монопольного режима.
//	Если НЕ БазоваяПоставка Тогда
//		УстановитьМонопольныйРежим(Ложь);
//	КонецЕсли; 

//	#Если Клиент Тогда
//	// Проверка выполнения обновления информационной базы.
//	Если Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда
//		Текст = "Не выполнено обновление информационной базы! Завершить работу системы?";
//		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );

//		Если Ответ = КодВозвратаДиалога.Да Тогда
//			ЗавершитьРаботуСистемы();
//		КонецЕсли;
//	КонецЕсли;
//	#КонецЕсли
//	
//КонецПроцедуры

Процедура ОбновитьПредопределенныеВариантыОтчетов() Экспорт
	
	СписокНастроек = Новый СписокЗначений;
	СписокНастроек.Добавить("НастройкаСписокРаботников", "Отчет ""Список работников"" : Список работников");
	СписокНастроек.Добавить("НастройкаСписокРаботниковОрганизации", "Отчет ""Список работников организаций"" : Список работников");
	
	
	СписокНастроек.Добавить("ПаспортныеДанныеРаботниковОрганизации", "Отчет ""Список работников организаций"" : Паспортные данные");
	СписокНастроек.Добавить("РодственникиСотрудниковОрганизации", "Отчет ""Список работников организаций"" : Родственники работников");
	СписокНастроек.Добавить("СтажиРаботниковОрганизации", "Отчет ""Список работников организаций"" : Стаж работы");
	//СписокНастроек.Добавить("СевернаяНадбавкаРаботниковОрганизации", "Отчет ""Список работников организаций"" : Северная надбавка");
	СписокНастроек.Добавить("ПаспортныеДанные", "Отчет ""Список работников"" : Паспортные данные");
	СписокНастроек.Добавить("РодственникиСотрудников", "Отчет ""Список работников"" : Родственники работников");
	//СписокНастроек.Добавить("ОбразованиеРаботников", "Отчет ""Список работников"" : Образование работников");
	//
	//СписокНастроек.Добавить("АнализНДФЛ", "Отчет ""Анализ налогов и взносов"" : Анализ НДФЛ");
	//СписокНастроек.Добавить("АнализЕСН", "Отчет ""Анализ налогов и взносов"" : Анализ ЕСН");
	//СписокНастроек.Добавить("АнализВзносовПФР", "Отчет ""Анализ налогов и взносов"" : Анализ ПФР");
	//СписокНастроек.Добавить("АнализФССНС", "Отчет ""Анализ налогов и взносов"" : Анализ ФСС на НС и ПЗ");
	//
	//СписокНастроек.Добавить("Отпуска", "Отчет ""Отпуска"" : Отпуска");
	//СписокНастроек.Добавить("ГрафикОтпусков", "Отчет ""Отпуска"" : График отпусков");
	//СписокНастроек.Добавить("ФактическиеОтпуска", "Отчет ""Отпуска"" : Фактические отпуска");
	//СписокНастроек.Добавить("ОтпускаРуководителей", "Отчет ""Отпуска"" : Отпуска руководителей");
	//	
	//СписокНастроек.Добавить("ОценкаОУППоКварталам", "Отчет ""Оценка эффективности ОУП"" : По кварталам");
	//СписокНастроек.Добавить("ОценкаОУППоОтветственным", "Отчет ""Оценка эффективности ОУП"" : По ответсвенным");
	//
	СписокНастроек.Добавить("АнализПоказателейПлановыеПоказатели", "Отчет ""Анализ показателей"" : Плановые показатели");
	СписокНастроек.Добавить("АнализПоказателейФактическиеПоказатели", "Отчет ""Анализ показателей"" : Фактические показатели");
	
	СписокНастроек.ОтметитьЭлементы("Выбирете варианты отчетов, которые требуется обновить:");
	
	ЗагрузитьНастройкиОтчетов(СписокНастроек)
	
КонецПроцедуры

Процедура ДобавитьНастройкуОтчета(НазваниеМакета, ЗадаватьВопрос = Истина) Экспорт
	
	ТекстовыйДокумент = Обработки.ОбновлениеИнформационнойБазы.ПолучитьМакет(НазваниеМакета);
	СтрокаXML = ТекстовыйДокумент.ПолучитьТекст();
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ЧтениеXML.Прочитать();
	СправочникОбъект = ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	//Определим есть ли существует ли такаяже настрока
	ЕстьОдинаковыйЭлемент = Ложь;
	ОбновляемыйЭлемент = Неопределено;
	
	ТЗ = "ВЫБРАТЬ
	     |	СохраненныеНастройки.Ссылка
	     |ИЗ
	     |	Справочник.СохраненныеНастройки КАК СохраненныеНастройки
	     |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СохраненныеНастройки.Пользователи КАК СохраненныеНастройкиПользователи
	     |		ПО СохраненныеНастройки.Ссылка = СохраненныеНастройкиПользователи.Ссылка
	     |ГДЕ
	     |	СохраненныеНастройкиПользователи.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	     |	И СохраненныеНастройки.Наименование = &Наименование
	     |	И СохраненныеНастройки.ТипНастройки = &ТипНастройки
	     |	И СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект";
		 
	Запрос = Новый Запрос(ТЗ);
	Запрос.УстановитьПараметр("Наименование", СправочникОбъект.Наименование);
	Запрос.УстановитьПараметр("ТипНастройки", СправочникОбъект.ТипНастройки);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", СправочникОбъект.НастраиваемыйОбъект);
	РезультатВопроса = Запрос.Выполнить();
	ЕстьОдинаковыйЭлемент =  Ложь;
	ОбновляемыйЭлемент = Неопределено;
	Если РезультатВопроса.Пустой() Тогда
		ЕстьОдинаковыйЭлемент =  Ложь;
		ОбновляемыйЭлемент = Неопределено;
	Иначе
		ЕстьОдинаковыйЭлемент = Истина;
		Выборка = РезультатВопроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ОбъектМетаданныхОтчет = Метаданные.НайтиПоТипу(Тип(СправочникОбъект.НастраиваемыйОбъект));
			#Если Клиент Тогда
				Если ЗадаватьВопрос Тогда
					Ответ = Вопрос("Вариант отчета " + СправочникОбъект.Наименование + " для отчета " + ОбъектМетаданныхОтчет.Синоним + " уже существует. Перезаписать?", РежимДиалогаВопрос.ДаНет);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						ОбновляемыйЭлемент = Выборка.Ссылка;
					КонецЕсли;
				Иначе
					Сообщить("Вариант отчета " + СправочникОбъект.Наименование + " для отчета " + ОбъектМетаданныхОтчет.Синоним + " не был загружен, так как похожая настройка уже существует. Рекомендуется обновить вариант отчета вручную в справочнике ""Сохраненные настройки"".");
				КонецЕсли;
			#КонецЕсли
			#Если ВнешнееСоединение Тогда
				ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка,,, "Вариант отчета " + СправочникОбъект.Наименование + " для отчета " + ОбъектМетаданныхОтчет.Синоним + " не был загружен, так как похожая настройка уже существует. Рекомендуется обновить вариант отчета вручную в справочнике ""Сохраненные настройки"".");
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновляемыйЭлемент = Неопределено И НЕ ЕстьОдинаковыйЭлемент Тогда
		ОбновляемыйЭлемент =  Справочники.СохраненныеНастройки.СоздатьЭлемент();
	ИначеЕсли ОбновляемыйЭлемент <> Неопределено И ЕстьОдинаковыйЭлемент Тогда
		ОбновляемыйЭлемент = ОбновляемыйЭлемент.ПолучитьОбъект();
	Иначе
		Возврат;
	КонецЕсли;
	
	ВариантОтчета                         = ОбновляемыйЭлемент;
	ВариантОтчета.Владелец                = Справочники.ГруппыПользователей.ВсеПользователи;
	ВариантОтчета.Наименование            = СправочникОбъект.Наименование;
	ВариантОтчета.НастраиваемыйОбъект     = СправочникОбъект.НастраиваемыйОбъект;
	ВариантОтчета.ТипНастройки            = СправочникОбъект.ТипНастройки;
	ВариантОтчета.СохранятьАвтоматически  = СправочникОбъект.СохранятьАвтоматически;
	ВариантОтчета.ИспользоватьПриОткрытии = СправочникОбъект.ИспользоватьПриОткрытии;
	ВариантОтчета.СохранятьПериод         = СправочникОбъект.СохранятьПериод;
	ВариантОтчета.ОткрыватьПриЗапуске     = СправочникОбъект.ОткрыватьПриЗапуске;
	ВариантОтчета.ОткрыватьПриЗапуске     = СправочникОбъект.ОткрыватьПриЗапуске;
	ВариантОтчета.Описание                = СправочникОбъект.Описание;
	ВариантОтчета.ХранилищеНастроек       = Новый ХранилищеЗначения(СправочникОбъект.ХранилищеНастроек.Получить());
	СтрокаПользователя = ВариантОтчета.Пользователи.Добавить();
	СтрокаПользователя.Пользователь   = Справочники.ГруппыПользователей.ВсеПользователи;
	СтрокаПользователя.ПравоИзменения = Истина;
//{{MRG[ <-> ]
	Попытка
		ВариантОтчета.Записать();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	ВариантОтчета.Записать();
//}}MRG[ <-> ]
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать настройку отчета");
	КонецПопытки;
КонецПроцедуры

Процедура ЗагрузитьНастройкиОтчетов(СписокНастроек)
	
	Для каждого ЭлементСпискаНастроек из СписокНастроек Цикл
		
		Если Не ЭлементСпискаНастроек.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьНастройкуОтчета(ЭлементСпискаНастроек.Значение);
		
	КонецЦикла;
	
КонецПроцедуры


// Проверить права текущего пользователя на выполнение обновления информационной базы.
//
Функция ЕстьПраваНаОбновлениеИнформационнойБазы()//О.Т. Аверсон 23.10.2015 № 658
	
	Возврат ПравоДоступа("МонопольныйРежим", Метаданные) И (РольДоступна("ПолныеПрава") или РольДоступна("ПолныеПраваБезЭкономики")); //О.Т. Аверсон 17.03.2017 № 335);
	
КонецФункции
